using System;
using System.Collections.Generic;
using System.Text.RegularExpressions;

namespace Wikifx.BlockChain.Core.Cookie
{
	/*
	【调用DEMO】

	GroupSetting gs = new GroupSetting();
	gs.GroupId = 100;
	gs.MaxSet = 500;
	gs.BeginTime = "aaaa";
	gs.SetNum = 600;
	gs.SetTime = DateTime.Now;

	string enstr = UserCookieFramework<GroupSetting>.ToEnCookieValue(gs);
	Console.WriteLine("生成的cookie值：" + enstr);
	Console.WriteLine("获取cookie值中时间戳的时间对象：" + UserCookieFramework<GroupSetting>.GetCookieCreateTime(enstr));

	DateTime dt;
	GroupSetting gs2 = UserCookieFramework<GroupSetting>.ValidateCookie(enstr, 0, out dt);
*/

	/// <summary>
	/// 【用户cookie框架】 - 提供用户cookie字符串生成方法和验证方法
	/// 用户cookie的生成方法：UserCookieFramework<T>.ToEnCookieValue
	/// cookie的结构 = <model属性1>  + "|" +  <model属性2>  + "|" + ... + "|" <model属性n> + "|" + <TimeToken>  + "|" + <MD5UserKey>
	/// <TimeToken> = 替换数值((DateTime.Now - DateTime.Parse("1945-06-21 13:23:45")).TotalSeconds)
	/// MD5UserKey = md5(<model属性1>  + "|" +  <model属性2>  + "|" + ... + "|" <model属性n> + "|" + <TimeToken>)
	/// 【cookie几种验证等级】
	/// 一、判断用户cookie是否存在，场景：适用于一般页面显示，无用户等级判断等。一般由JS端就可实现
	/// 二、TimeToken合法性验证，场景：适用于判断cookie是否过期，也可以强制指定时间外的cookie过期。方法：UserCookieFramework<T>.GetCookieCreateTime
	/// 三、前后值判断，场景：判断用户cookie是否合法，方法：UserCookieFramework<T>.ValidateCookie
	/// 【注意】cookie中不要显示用户的明文ID，要将明文ID做DES加密
	/// </summary>
	/// <typeparam name="T"></typeparam>
	public class UserCookieFramework<T> where T : new()
	{
		//TimeToken起始时间
		private static DateTime sinceTime = DateTime.Parse("1945-06-21 13:23:45");

		#region [三维数组，用于替换TimeToken中的数字，作用相当于密码表]
		private static string[,,] numZone = new string[10, 20, 10] {
			{
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"}
			},
			{
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"}
			},
			{
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"}
			},
			{
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"}

			},
			{
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"}
			},
			{
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"}
			},
			{
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"}
			},
			{
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"}
			},
			{
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"}
			},
			{
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"6", "7", "8", "9", "0", "1", "2", "3", "4", "5"},
				{"8", "9", "0", "1", "2", "3", "4", "5", "6", "7"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"5", "6", "7", "8", "9", "0", "1", "2", "3", "4"},
				{"4", "5", "6", "7", "8", "9", "0", "1", "2", "3"},
				{"2", "3", "4", "5", "6", "7", "8", "9", "0", "1"},
				{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9"},
				{"7", "8", "9", "0", "1", "2", "3", "4", "5", "6"},
				{"9", "0", "1", "2", "3", "4", "5", "6", "7", "8"},
				{"3", "4", "5", "6", "7", "8", "9", "0", "1", "2"}
			}
		};
		#endregion

		/// <summary>
		/// 将model值转化为加密后的cookievalue
		/// </summary>
		/// <param name="model">指定类型T的对象</param>
		/// <param name="numZoneIndex">时间戳加密表索引（0-9），注意：取对象中固定的属性值，一般为ID的最后一位或第一位</param>
		/// <returns>加密后的cookievalue</returns>
		public static string ToEnCookieValue(T model, int numZoneIndex = 0)
		{
			List<string> vals = new List<string>();

			//根据T类型，获取model中的所有属性值
			System.Reflection.PropertyInfo[] propertyInfo = typeof(T).GetProperties(System.Reflection.BindingFlags.Public | System.Reflection.BindingFlags.Instance);
			foreach (System.Reflection.PropertyInfo pinfo in propertyInfo)
			{
				if (pinfo != null)
				{
					if (pinfo.GetValue(model, null) != null)
						vals.Add(pinfo.GetValue(model, null).ToString());//获取对象属性值
				}
			}

			//添加TimeToken
			if (numZoneIndex >= 10 || numZoneIndex < 0) numZoneIndex = 0;
			vals.Add(createCookieTimeToken(numZoneIndex));

			//添加Md5验证字段
			vals.Add(HE.EncryptCommon.EncryptCore.HuanrongMD5By32(string.Join("|", vals)));

			return string.Join("|", vals);
		}

		private static string createCookieTimeToken(int nzi)
		{
			string strCert = Math.Floor((DateTime.Now - sinceTime).TotalSeconds).ToString();

			int int_num = -1;
			string str_num = "", lastCert = "";

			for (int i = 0; i < strCert.Length; i++)
			{
				str_num = strCert.Substring(i, 1);
				if (Int32.TryParse(str_num, out int_num))
				{
					if (int_num > -1)
					{
						lastCert += numZone[nzi, i, int_num];
					}
					else
					{
						lastCert = "";
						break;
					}
				}
				else
				{
					lastCert = "";
					break;
				}
			}

			return lastCert;
		}

		/// <summary>
		/// 根据加密cookie值，获取cookie创建时间
		/// </summary>
		/// <param name="cookieval">加密后的cookievalue</param>
		/// <param name="numZoneIndex">时间戳加密表索引（0-9），注意：取对象中固定的属性值，一般为ID的最后一位或第一位</param>
		/// <returns>当前cookie的创建时间</returns>
		public static DateTime GetCookieCreateTime(string cookieval, int numZoneIndex = 0)
		{
			string[] vals = cookieval.Split('|');
			if (numZoneIndex >= 10 || numZoneIndex < 0) numZoneIndex = 0;
			string lastCert = vals[vals.Length - 2];

			try
			{
				return sinceTime.AddSeconds(double.Parse(deTimeSpan(lastCert, numZoneIndex)));
			}
			catch
			{
				return DateTime.MinValue;
			}
		}

		private static string deTimeSpan(string enTimeSpan, int nzi)
		{
			int int_num = -1;
			string str_num = "", strCert = "";

			for (int i = 0; i < enTimeSpan.Length; i++)
			{
				str_num = enTimeSpan.Substring(i, 1);
				if (Int32.TryParse(str_num, out int_num))
				{
					if (int_num > -1)
					{
						for (int j = 0; j < 10; j++)
						{
							if (int_num == Convert.ToInt32(numZone[nzi, i, j]))
							{
								strCert += j.ToString();
								break;
							}
						}
					}
					else
					{
						strCert = "";
						break;
					}
				}
				else
				{
					strCert = "";
					break;
				}
			}

			return strCert;
		}

		/// <summary>
		/// 根据加密cookie值，检测cookie的合法性，并返回相应的cookie对象
		/// </summary>
		/// <param name="cookieval">加密后的cookievalue</param>
		/// <param name="numZoneIndex">时间戳加密表索引（0-9），注意：取对象中固定的属性值，一般为ID的最后一位或第一位</param>
		/// <param name="model">当前cookie的对象</param>
		/// <param name="crateTime">当前cookie创建时间</param>
		/// <returns></returns>
		public static T ValidateCookie(string cookieval, int numZoneIndex, out DateTime createTime)
		{
			string[] vals = cookieval.Split('|');
			if (numZoneIndex >= 10 || numZoneIndex < 0) numZoneIndex = 0;

			#region [读取时间戳，不成功返回空对象]
			string lastCert = vals[vals.Length - 2];
			try
			{
				createTime = sinceTime.AddSeconds(double.Parse(deTimeSpan(lastCert, numZoneIndex)));
			}
			catch
			{
				createTime = DateTime.MinValue;
			}

			if (createTime == DateTime.MinValue)
				return default(T);
			#endregion

			#region [前后值验证，不成功返回空对象]
			string originalStr = Regex.Replace(cookieval, @"\|[^\|]+$", "", RegexOptions.IgnoreCase);
			try
			{
				if (HE.EncryptCommon.EncryptCore.HuanrongMD5By32(originalStr) != vals[vals.Length - 1])
					return default(T);
			}
			catch
			{
				return default(T);
			}
			#endregion

			#region [将cookieval转为model对象]
			T model = new T();
			//根据T类型，获取model中的所有属性值
			System.Reflection.PropertyInfo[] propertyInfo = typeof(T).GetProperties(System.Reflection.BindingFlags.Public | System.Reflection.BindingFlags.Instance);
			int i = 0;
			object obj = null;
			foreach (System.Reflection.PropertyInfo pinfo in propertyInfo)
			{
				if (pinfo != null)
				{
					//非泛型
					if (!pinfo.PropertyType.IsGenericType)
						obj = string.IsNullOrEmpty(vals[i]) ? null : Convert.ChangeType(vals[i], pinfo.PropertyType);
					else //泛型Nullable<>
					{
						Type genericTypeDefinition = pinfo.PropertyType.GetGenericTypeDefinition();
						if (genericTypeDefinition == typeof(Nullable<>))
						{
							obj = string.IsNullOrEmpty(vals[i]) ? null : Convert.ChangeType(vals[i], Nullable.GetUnderlyingType(pinfo.PropertyType));
						}
					}
					pinfo.SetValue(model, obj, null);
				}
				i++;
			}
			#endregion

			return model;
		}
	}
}
